espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG24/Include/efr32bg24_mpahbram.h
/* Bit fields for MPAHBRAM ECCERRADDR2 */
#define _MPAHBRAM_ECCERRADDR2_RESETVALUE                  0x00000000UL                              /**< Default value for MPAHBRAM_ECCERRADDR2      */
#define _MPAHBRAM_ECCERRADDR2_MASK                        0xFFFFFFFFUL                              /**< Mask for MPAHBRAM_ECCERRADDR2               */
#define _MPAHBRAM_ECCERRADDR2_ADDR_SHIFT                  0                                         /**< Shift value for MPAHBRAM_ADDR               */
#define _MPAHBRAM_ECCERRADDR2_ADDR_MASK                   0xFFFFFFFFUL                              /**< Bit mask for MPAHBRAM_ADDR                  */
#define _MPAHBRAM_ECCERRADDR2_ADDR_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for MPAHBRAM_ECCERRADDR2       */
#define MPAHBRAM_ECCERRADDR2_ADDR_DEFAULT                 (_MPAHBRAM_ECCERRADDR2_ADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for MPAHBRAM_ECCERRADDR2*/

/* Bit fields for MPAHBRAM ECCERRADDR3 */
#define _MPAHBRAM_ECCERRADDR3_RESETVALUE                  0x00000000UL                              /**< Default value for MPAHBRAM_ECCERRADDR3      */
#define _MPAHBRAM_ECCERRADDR3_MASK                        0xFFFFFFFFUL                              /**< Mask for MPAHBRAM_ECCERRADDR3               */
#define _MPAHBRAM_ECCERRADDR3_ADDR_SHIFT                  0                                         /**< Shift value for MPAHBRAM_ADDR               */
#define _MPAHBRAM_ECCERRADDR3_ADDR_MASK                   0xFFFFFFFFUL                              /**< Bit mask for MPAHBRAM_ADDR                  */
#define _MPAHBRAM_ECCERRADDR3_ADDR_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for MPAHBRAM_ECCERRADDR3       */
#define MPAHBRAM_ECCERRADDR3_ADDR_DEFAULT                 (_MPAHBRAM_ECCERRADDR3_ADDR_DEFAULT << 0) /**< Shifted mode DEFAULT for MPAHBRAM_ECCERRADDR3*/

/* Bit fields for MPAHBRAM ECCMERRIND */
#define _MPAHBRAM_ECCMERRIND_RESETVALUE                   0x00000000UL                           /**< Default value for MPAHBRAM_ECCMERRIND       */
#define _MPAHBRAM_ECCMERRIND_MASK                         0x0000000FUL                           /**< Mask for MPAHBRAM_ECCMERRIND                */
#define MPAHBRAM_ECCMERRIND_P0                            (0x1UL << 0)                           /**< Multiple ECC errors on AHB port 0           */
#define _MPAHBRAM_ECCMERRIND_P0_SHIFT                     0                                      /**< Shift value for MPAHBRAM_P0                 */
#define _MPAHBRAM_ECCMERRIND_P0_MASK                      0x1UL                                  /**< Bit mask for MPAHBRAM_P0                    */
#define _MPAHBRAM_ECCMERRIND_P0_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for MPAHBRAM_ECCMERRIND        */
#define MPAHBRAM_ECCMERRIND_P0_DEFAULT                    (_MPAHBRAM_ECCMERRIND_P0_DEFAULT << 0) /**< Shifted mode DEFAULT for MPAHBRAM_ECCMERRIND*/
#define MPAHBRAM_ECCMERRIND_P1                            (0x1UL << 1)                           /**< Multiple ECC errors on AHB port 1           */
#define _MPAHBRAM_ECCMERRIND_P1_SHIFT                     1                                      /**< Shift value for MPAHBRAM_P1                 */
#define _MPAHBRAM_ECCMERRIND_P1_MASK                      0x2UL                                  /**< Bit mask for MPAHBRAM_P1                    */
#define _MPAHBRAM_ECCMERRIND_P1_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for MPAHBRAM_ECCMERRIND        */
#define MPAHBRAM_ECCMERRIND_P1_DEFAULT                    (_MPAHBRAM_ECCMERRIND_P1_DEFAULT << 1) /**< Shifted mode DEFAULT for MPAHBRAM_ECCMERRIND*/
#define MPAHBRAM_ECCMERRIND_P2                            (0x1UL << 2)                           /**< Multiple ECC errors on AHB port 2           */
#define _MPAHBRAM_ECCMERRIND_P2_SHIFT                     2                                      /**< Shift value for MPAHBRAM_P2                 */
#define _MPAHBRAM_ECCMERRIND_P2_MASK                      0x4UL                                  /**< Bit mask for MPAHBRAM_P2                    */
#define _MPAHBRAM_ECCMERRIND_P2_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for MPAHBRAM_ECCMERRIND        */
#define MPAHBRAM_ECCMERRIND_P2_DEFAULT                    (_MPAHBRAM_ECCMERRIND_P2_DEFAULT << 2) /**< Shifted mode DEFAULT for MPAHBRAM_ECCMERRIND*/
#define MPAHBRAM_ECCMERRIND_P3                            (0x1UL << 3)                           /**< Multiple ECC errors on AHB port 2           */
#define _MPAHBRAM_ECCMERRIND_P3_SHIFT                     3                                      /**< Shift value for MPAHBRAM_P3                 */
#define _MPAHBRAM_ECCMERRIND_P3_MASK                      0x8UL                                  /**< Bit mask for MPAHBRAM_P3                    */
#define _MPAHBRAM_ECCMERRIND_P3_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for MPAHBRAM_ECCMERRIND        */
#define MPAHBRAM_ECCMERRIND_P3_DEFAULT                    (_MPAHBRAM_ECCMERRIND_P3_DEFAULT << 3) /**< Shifted mode DEFAULT for MPAHBRAM_ECCMERRIND*/

/* Bit fields for MPAHBRAM IF */
#define _MPAHBRAM_IF_RESETVALUE                           0x00000000UL                          /**< Default value for MPAHBRAM_IF               */
#define _MPAHBRAM_IF_MASK                                 0x000000FFUL                          /**< Mask for MPAHBRAM_IF                        */
#define MPAHBRAM_IF_AHB0ERR1B                             (0x1UL << 0)                          /**< AHB0 1-bit ECC Error Interrupt Flag         */
#define _MPAHBRAM_IF_AHB0ERR1B_SHIFT                      0                                     /**< Shift value for MPAHBRAM_AHB0ERR1B          */
#define _MPAHBRAM_IF_AHB0ERR1B_MASK                       0x1UL                                 /**< Bit mask for MPAHBRAM_AHB0ERR1B             */
#define _MPAHBRAM_IF_AHB0ERR1B_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for MPAHBRAM_IF                */
#define MPAHBRAM_IF_AHB0ERR1B_DEFAULT                     (_MPAHBRAM_IF_AHB0ERR1B_DEFAULT << 0) /**< Shifted mode DEFAULT for MPAHBRAM_IF        */
#define MPAHBRAM_IF_AHB1ERR1B                             (0x1UL << 1)                          /**< AHB1 1-bit ECC Error Interrupt Flag         */
#define _MPAHBRAM_IF_AHB1ERR1B_SHIFT                      1                                     /**< Shift value for MPAHBRAM_AHB1ERR1B          */
#define _MPAHBRAM_IF_AHB1ERR1B_MASK                       0x2UL                                 /**< Bit mask for MPAHBRAM_AHB1ERR1B             */
#define _MPAHBRAM_IF_AHB1ERR1B_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for MPAHBRAM_IF                */
#define MPAHBRAM_IF_AHB1ERR1B_DEFAULT                     (_MPAHBRAM_IF_AHB1ERR1B_DEFAULT << 1) /**< Shifted mode DEFAULT for MPAHBRAM_IF        */
#define MPAHBRAM_IF_AHB2ERR1B                             (0x1UL << 2)                          /**< AHB2 1-bit ECC Error Interrupt Flag         */
#define _MPAHBRAM_IF_AHB2ERR1B_SHIFT                      2                                     /**< Shift value for MPAHBRAM_AHB2ERR1B          */
#define _MPAHBRAM_IF_AHB2ERR1B_MASK                       0x4UL                                 /**< Bit mask for MPAHBRAM_AHB2ERR1B             */
#define _MPAHBRAM_IF_AHB2ERR1B_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for MPAHBRAM_IF                */
#define MPAHBRAM_IF_AHB2ERR1B_DEFAULT                     (_MPAHBRAM_IF_AHB2ERR1B_DEFAULT << 2) /**< Shifted mode DEFAULT for MPAHBRAM_IF        */
#define MPAHBRAM_IF_AHB3ERR1B                             (0x1UL << 3)                          /**< AHB3 1-bit ECC Error Interrupt Flag         */
#define _MPAHBRAM_IF_AHB3ERR1B_SHIFT                      3                                     /**< Shift value for MPAHBRAM_AHB3ERR1B          */
#define _MPAHBRAM_IF_AHB3ERR1B_MASK                       0x8UL                                 /**< Bit mask for MPAHBRAM_AHB3ERR1B             */
#define _MPAHBRAM_IF_AHB3ERR1B_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for MPAHBRAM_IF                */
#define MPAHBRAM_IF_AHB3ERR1B_DEFAULT                     (_MPAHBRAM_IF_AHB3ERR1B_DEFAULT << 3) /**< Shifted mode DEFAULT for MPAHBRAM_IF        */
#define MPAHBRAM_IF_AHB0ERR2B                             (0x1UL << 4)                          /**< AHB0 2-bit ECC Error Interrupt Flag         */
#define _MPAHBRAM_IF_AHB0ERR2B_SHIFT                      4                                     /**< Shift value for MPAHBRAM_AHB0ERR2B          */
#define _MPAHBRAM_IF_AHB0ERR2B_MASK                       0x10UL                                /**< Bit mask for MPAHBRAM_AHB0ERR2B             */
#define _MPAHBRAM_IF_AHB0ERR2B_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for MPAHBRAM_IF                */
#define MPAHBRAM_IF_AHB0ERR2B_DEFAULT                     (_MPAHBRAM_IF_AHB0ERR2B_DEFAULT << 4) /**< Shifted mode DEFAULT for MPAHBRAM_IF        */
#define MPAHBRAM_IF_AHB1ERR2B                             (0x1UL << 5)                          /**< AHB1 2-bit ECC Error Interrupt Flag         */
#define _MPAHBRAM_IF_AHB1ERR2B_SHIFT                      5                                     /**< Shift value for MPAHBRAM_AHB1ERR2B          */
#define _MPAHBRAM_IF_AHB1ERR2B_MASK                       0x20UL                                /**< Bit mask for MPAHBRAM_AHB1ERR2B             */
#define _MPAHBRAM_IF_AHB1ERR2B_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for MPAHBRAM_IF                */
#define MPAHBRAM_IF_AHB1ERR2B_DEFAULT                     (_MPAHBRAM_IF_AHB1ERR2B_DEFAULT << 5) /**< Shifted mode DEFAULT for MPAHBRAM_IF        */
#define MPAHBRAM_IF_AHB2ERR2B                             (0x1UL << 6)                          /**< AHB2 2-bit ECC Error Interrupt Flag         */
#define _MPAHBRAM_IF_AHB2ERR2B_SHIFT                      6                                     /**< Shift value for MPAHBRAM_AHB2ERR2B          */
#define _MPAHBRAM_IF_AHB2ERR2B_MASK                       0x40UL                                /**< Bit mask for MPAHBRAM_AHB2ERR2B             */
#define _MPAHBRAM_IF_AHB2ERR2B_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for MPAHBRAM_IF                */
#define MPAHBRAM_IF_AHB2ERR2B_DEFAULT                     (_MPAHBRAM_IF_AHB2ERR2B_DEFAULT << 6) /**< Shifted mode DEFAULT for MPAHBRAM_IF        */
#define MPAHBRAM_IF_AHB3ERR2B                             (0x1UL << 7)                          /**< AHB3 2-bit ECC Error Interrupt Flag         */
#define _MPAHBRAM_IF_AHB3ERR2B_SHIFT                      7                                     /**< Shift value for MPAHBRAM_AHB3ERR2B          */
#define _MPAHBRAM_IF_AHB3ERR2B_MASK                       0x80UL                                /**< Bit mask for MPAHBRAM_AHB3ERR2B             */
#define _MPAHBRAM_IF_AHB3ERR2B_DEFAULT                    0x00000000UL                          /**< Mode DEFAULT for MPAHBRAM_IF                */
#define MPAHBRAM_IF_AHB3ERR2B_DEFAULT                     (_MPAHBRAM_IF_AHB3ERR2B_DEFAULT << 7) /**< Shifted mode DEFAULT for MPAHBRAM_IF        */

